fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Период.ДатаНачала = НачалоНедели(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецНедели(ТекущаяДатаСеанса());

	ЗаполнитьПланировщик(Период);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ЗаполнитьПланировщик(Период);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	ЗаполнитьПланировщик(Период);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы, , , , , , );

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("Дата", КонецДня(Начало));
	ДанныеОбъекта.Вставить("Специалист", ЗначенияИзмерений.Получить("Специалист"));
	ДанныеОбъекта.Вставить("ДатаПроведенияРабот", Начало);
	ДанныеОбъекта.Вставить("ВремяНачалаРаботПлан", Начало);
	ДанныеОбъекта.Вставить("ВремяОкончанияРаботПлан", Конец);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеОбъекта);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы, , , , , , );
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПланировщик(Период)

	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.Измерения.Очистить();
	Планировщик.Элементы.Очистить();

	ИзмерениеСпециалист = Планировщик.Измерения.Добавить("Специалист");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот >= &НачалоПериода
	|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <= &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.Специалист,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПроведенияРабот
	|ИТОГИ
	|ПО
	|	Специалист";

	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаСпециалисты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаСпециалисты.Следующий() Цикл

		НовоеИзмерение = ИзмерениеСпециалист.Элементы.Добавить(ВыборкаСпециалисты.Специалист,
			ВыборкаСпециалисты.Специалист);
		Если (ИзмерениеСпециалист.Элементы.Индекс(НовоеИзмерение) + 1) % 2 = 0 Тогда
			НовоеИзмерение.ЦветФона = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветМеткиГолубой");
		Иначе
			НовоеИзмерение.ЦветФона = ОбщегоНазначенияВызовСервера.ЦветСтиля("ФонУправляющегоПоля");
		КонецЕсли;
		ВыборкаДетальныеЗаписи = ВыборкаСпециалисты.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаНачала = Дата(Год(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот), Месяц(
			ВыборкаДетальныеЗаписи.ДатаПроведенияРабот), День(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот), Час(
			ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан), Минута(ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан), Секунда(
				ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан));
			ДатаОкончания = Дата(Год(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот), Месяц(
			ВыборкаДетальныеЗаписи.ДатаПроведенияРабот), День(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот), Час(
			ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан), Минута(
			ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан), Секунда(
			ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан));
			НовыйЭлемент = Планировщик.Элементы.Добавить(ДатаНачала, ДатаОкончания);
			ЗначениеИзмеренияСпециалист = Новый Соответствие;
			ЗначениеИзмеренияСпециалист.Вставить("Специалист", ВыборкаДетальныеЗаписи.Специалист);
			НовыйЭлемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(ЗначениеИзмеренияСпециалист);
			НовыйЭлемент.Подсказка = ВыборкаДетальныеЗаписи.Ссылка;
			НовыйЭлемент.Значение = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЦикла;

	Планировщик.ТекущиеПериодыОтображения.Добавить(Период.ДатаНачала, Период.ДатаОкончания);
	Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;

КонецПроцедуры

#КонецОбласти
